#include "Mode.h"


const Mode Mode::MODE_320x240x60(0, 48, 24, 320, 10, 2, 33, 240, 12587500, 0, 0, 2); // было 8
const Mode Mode::MODE_640x480x60(0, 96, 48, 640, 10, 2, 33, 480, 25175000); // было 16

const Mode Mode::MODE_640x400x70(16, 96, 48, 640, 12, 2, 35, 400, 25175000);
const Mode Mode::MODE_320x200x70(8, 48, 24, 320, 12, 2, 35, 200, 12587500, 0, 0, 2);
const Mode Mode::MODE_800x600x56(24, 72, 128, 800, 1, 2, 22, 600, 36000000);
const Mode Mode::MODE_800x600x60(40, 128, 88, 800, 1, 4, 23, 600, 40000000);
